In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r"C:\Users\mitra\Desktop\MAIN\MITRA P\ML\ML TECHNIQUES\FEATURE SCALING\STANDARDIZATION\Social_Network_Ads (1).csv")

In [3]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [5]:
df=df.iloc[:,2:]

In [6]:
df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [8]:
X=df.drop(["Purchased"],axis=1)

In [10]:
y=df["Purchased"]

### Split the data

In [11]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=0)

In [12]:
x_train.shape

(280, 2)

In [13]:
x_test.shape

(120, 2)

### STANDARDIZATION

In [15]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

# Fit the Scaler to the train set, it will learn the parameters
scaler.fit(x_train)

# Transform train & test sets
x_train_scaled=scaler.transform(x_train)
x_test_scaled=scaler.transform(x_test)

In [17]:
scaler.mean_

array([3.78642857e+01, 6.98071429e+04])

In [18]:
x_train_scaled=pd.DataFrame(x_train_scaled,columns=x_train.columns)
x_test_scaled=pd.DataFrame(x_test_scaled,columns=x_test.columns)

In [19]:
np.round(x_train.describe(),1)

         Age  EstimatedSalary
count  280.0            280.0
mean    37.9          69807.1
std     10.2          34641.2
min     18.0          15000.0
25%     30.0          43000.0
50%     37.0          70500.0
75%     46.0          88000.0
max     60.0         150000.0

In [20]:
np.round(x_test.describe(),1)

         Age  EstimatedSalary
count  120.0            120.0
mean    37.2          69591.7
std     11.1          32933.7
min     18.0          15000.0
25%     28.0          47000.0
50%     36.0          64500.0
75%     45.2          87000.0
max     60.0         150000.0